from django.core.management.base import BaseCommand
from banks.models import Bank


class Command(BaseCommand):
    help = 'Seed initial Iranian bank data'

    def handle(self, *args, **options):
        banks = [
            'بانک سپه','بانک ملی ایران', 'بانک مسکن', 'پست بانک ایران', 'بانک کشاورزی', 'بانک توسعه تعاون',
            'بانک صنعت و معدن','بانک توسعه صادرات ایران', 'بانک اقتصاد نوین', 'بانک ایران زمین', 'بانک پارسیان',
            'بانک پاسارگاد','بانک تجارت','بانک خاورمیانه','بانک دی','بانک سامان','بانک سرمایه', 'بانک سینا', 'بانک شهر',
            'بانک صادرات ایران', 'بانک قرض‌الحسنه رسالت','بانک کارآفرین', 'بانک گردشگری', 'بانک ملت', 
            'بانک مشترک ایران و ونزوئلا','بانک قرض‌الحسنه مهر ایران', 'بانک رفاه کارگران','مؤسسه اعتباری ملل',
            'کیوبانک', 'بانکت', 'ویپاد', 'بلوبانک', 'بانکینو', 'توبانک', 'های‌بانک', 'باران', 'امیدبانک', 'بام',
            'باجت', 'سپینو', 'سیبانک', 'متابانک', 'بانکواره', 'فرارفاه', 'فراز بانک', 'ردبانک','دیما', 'پارسیان من',
            'تیم بانک', 'جهش بانک'
        ]
        created = 0
        for name in banks:
            _, was_created = Bank.objects.get_or_create(name=name)
            if was_created:
                created += 1
        self.stdout.write(
            self.style.SUCCESS(f'Seeded {created} banks ({len(banks)} total)')
        )
